АлогистикТест2/src/InformationRegisters/ДополнительныеРеквизиты/ДополнительныеРеквизиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеРеквизиты</name>
  <resources>
    <name>ПВХ</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </resources>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>EnumRef.ФиксированныеДопРеквизиты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыСерийныхНомеров/алк_ПараметрыСерийныхНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыСерийныхНомеров</name>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСерии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодСерии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/ФиксированныеДопРеквизиты/ФиксированныеДопРеквизиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФиксированныеДопРеквизиты</name>
  <enumValues>
    <name>Порода</name>
  </enumValues>
  <enumValues>
    <name>Сорт</name>
  </enumValues>
  <enumValues>
    <name>Длина</name>
  </enumValues>
  <enumValues>
    <name>Сечение</name>
  </enumValues>
  <enumValues>
    <name>Влажность</name>
  </enumValues>
  <enumValues>
    <name>Поверхность</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/НаборыДополнительныхРеквизитовИСведений/НаборыДополнительныхРеквизитовИСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыДополнительныхРеквизитовИСведений</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Справочник_Номенклатура</name>
      <description>Номенклатура</description>
    </items>
    <items>
      <name>Справочник_ХарактеристикиНоменклатуры</name>
      <description>Характеристики номенклатуры</description>
    </items>
    <items>
      <name>Документ_АвансовыйОтчет</name>
      <description>Авансовый отчет</description>
    </items>
    <items>
      <name>Документ_АктВыполненныхРабот</name>
      <description>Акт выполненных работ</description>
    </items>
    <items>
      <name>Справочник_ВнешниеПользователи</name>
      <description>Внешние пользователи</description>
    </items>
    <items>
      <name>Документ_ДоговорКредитаИЗайма</name>
      <description>Договор кредита и займа</description>
    </items>
    <items>
      <name>Справочник_ДоговорыКонтрагентов</name>
      <description>Договоры контрагентов</description>
    </items>
    <items>
      <name>Документ_ПриемИПередачаВРемонт</name>
      <description>Документ прием и передача в ремонт</description>
    </items>
    <items>
      <name>Документ_ЗаданиеНаРаботу</name>
      <description>Задание на работу</description>
    </items>
    <items>
      <name>Документ_ЗаказНаПроизводство</name>
      <description>Заказ на производство</description>
    </items>
    <items>
      <name>Документ_ЗаказПокупателя</name>
      <description>Заказ покупателя</description>
    </items>
    <items>
      <name>Документ_ЗаказПоставщику</name>
      <description>Заказ поставщику</description>
    </items>
    <items>
      <name>Документ_РасходДСПлан</name>
      <description>Заявка на расход денег</description>
    </items>
    <items>
      <name>Справочник_ВнеоборотныеАктивы</name>
      <description>Имущество</description>
    </items>
    <items>
      <name>Справочник_КонтактныеЛица</name>
      <description>Контактные лица</description>
    </items>
    <items>
      <name>Справочник_Контрагенты</name>
      <description>Контрагенты</description>
    </items>
    <items>
      <name>Документ_КорректировкаПоступления</name>
      <description>Корректировка поступления</description>
    </items>
    <items>
      <name>Документ_КорректировкаРеализации</name>
      <description>Корректировка реализации</description>
    </items>
    <items>
      <name>Документ_НачисленияПоКредитамИЗаймам</name>
      <description>Начисления по кредитам и займам</description>
    </items>
    <items>
      <name>Справочник_НоменклатураПоставщиков</name>
      <description>Номенклатура поставщиков</description>
    </items>
    <items>
      <name>Документ_ОперацияПоПлатежнымКартам</name>
      <description>Операция по платежным картам</description>
    </items>
    <items>
      <name>Справочник_Организации</name>
      <description>Организации</description>
    </items>
    <items>
      <name>Справочник_ПапкиФайлов</name>
      <description>Папки файлов</description>
    </items>
    <items>
      <name>Справочник_ПартииНоменклатуры</name>
      <description>Партии номенклатуры</description>
    </items>
    <items>
      <name>Справочник_Пользователи</name>
      <description>Пользователи</description>
    </items>
    <items>
      <name>Документ_ПоступлениеВКассу</name>
      <description>Поступление в кассу</description>
    </items>
    <items>
      <name>Документ_ПоступлениеНаСчет</name>
      <description>Поступление на счет</description>
    </items>
    <items>
      <name>Документ_ПриходнаяНакладная</name>
      <description>Приходная накладная</description>
    </items>
    <items>
      <name>Справочник_Проекты</name>
      <description>Проекты</description>
    </items>
    <items>
      <name>Документ_РасходИзКассы</name>
      <description>Расход из кассы</description>
    </items>
    <items>
      <name>Документ_РасходСоСчета</name>
      <description>Расход со счета</description>
    </items>
    <items>
      <name>Документ_РасходнаяНакладная</name>
      <description>Расходная накладная</description>
    </items>
    <items>
      <name>Справочник_СерийныеНомера</name>
      <description>Серийные номера</description>
    </items>
    <items>
      <name>Документ_Событие</name>
      <description>Событие</description>
    </items>
    <items>
      <name>Справочник_СтатьиДвиженияДенежныхСредств</name>
      <description>Статьи движения денежных средств</description>
    </items>
    <items>
      <name>Справочник_СтруктурныеЕдиницы</name>
      <description>Структурные единицы</description>
    </items>
    <items>
      <name>Документ_СчетНаОплату</name>
      <description>Счет на оплату</description>
    </items>
    <items>
      <name>Документ_СчетНаОплатуПоставщика</name>
      <description>Счет на оплату поставщика</description>
    </items>
    <items>
      <name>Справочник_ТранспортныеСредства</name>
      <description>Транспортные средства</description>
    </items>
    <items>
      <name>Справочник_Файлы</name>
      <description>Файлы</description>
    </items>
    <items>
      <name>Справочник_ФизическиеЛица</name>
      <description>Физические лица</description>
    </items>
  </predefined>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСведений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеСведения</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/CommonModules/АлгоритмыСвойстваИХарактеристики/Module.bsl
Функция ПолучитьВидСвойстваПоУказателю(КатегорияНоменклатуры, Свойство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|ГДЕ
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", КатегорияНоменклатуры.НаборСвойствХарактеристики);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СтрНайти(ВыборкаДетальныеЗаписи.Свойство.Наименование, Свойство) > 0 Тогда
			Возврат ВыборкаДетальныеЗаписи.Свойство;	
		КонецЕсли; 	
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьВидСвойстваПоУказателю

Функция ПолучитьВидСвойства(ФиквированноеСвойство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизиты.ПВХ
	|ИЗ
	|	РегистрСведений.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	ДополнительныеРеквизиты.Реквизит = &Реквизит";
	
	Запрос.УстановитьПараметр("Реквизит", ФиквированноеСвойство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.ПВХ;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции


Функция СоздатьХарактеристикуПоНаборуСвойств(ВладелецХарактеристики, ТаблицаСвойств) Экспорт
	
	// Выполнить необходимые проверки
	/////////////////////////////////
	
	Характеристика = Неопределено;
	
	Попытка
		НачатьТранзакцию();
		
		НоваяХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		НоваяХарактеристика.Владелец = ВладелецХарактеристики;
		
		Наименование = "";
		Для каждого стрСвойство Из ТаблицаСвойств Цикл
			НоваяСтрокаСвойства = НоваяХарактеристика.ДополнительныеРеквизиты.Добавить();
			НоваяСтрокаСвойства.Свойство = стрСвойство.Свойство;
			НоваяСтрокаСвойства.Значение = стрСвойство.Значение;
			Наименование = Наименование + ?(Наименование = "", "", ", ") + стрСвойство.Значение.Наименование;
		КонецЦикла; 
		
		////Наименования = СформироватьНаименованияПоШаблонуСервер("Оба", ВладелецХарактеристики.Ссылка);
		////НоваяХарактеристика.Наименование       = Наименования.Наименование;
		////НоваяХарактеристика.НаименованиеПолное = Наименования.НаименованиеПолное;
		//
		//ДанныеДляФормированияНаименования = НоменклатураСервер.ФормулаНаименования(ВладелецХарактеристики.ШаблонРабочегоНаименованияХарактеристики, НоваяХарактеристика); 
		//Наименование = НаименованиеПоФормуле(ДанныеДляФормированияНаименования, ВладелецХарактеристики);
		
		НоваяХарактеристика.Наименование          = Наименование;
		НоваяХарактеристика.НаименованиеДляПечати = Наименование;
		
		НоваяХарактеристика.Записать();
		
		Характеристика = НоваяХарактеристика.Ссылка;
		ЗафиксироватьТранзакцию();
	Исключение
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки; 
	
	Возврат Характеристика;
	
КонецФункции  // СоздатьХарактеристикуПоНаборуСвойств


Функция СформироватьНаименованияПоШаблонуСервер(ВариантФормирования, СправочникОбъект)
	
	СтруктураНаименований = Новый Структура("Наименование, НаименованиеПолное", "", "");
	
	ШаблонРабочегоНаименования  = СправочникОбъект.ШаблонРабочегоНаименованияХарактеристики;
	ШаблонНаименованияДляПечати = СправочникОбъект.ШаблонНаименованияДляПечатиХарактеристики;
	
	Если ВариантФормирования = "Рабочее" ИЛИ ВариантФормирования = "Оба" Тогда
		Наименование = НоменклатураСервер.НаименованиеПоШаблону(ШаблонРабочегоНаименования, СправочникОбъект);
		СтруктураНаименований.Наименование = Наименование;
	КонецЕсли;
	Если ВариантФормирования = "ДляПечати" ИЛИ ВариантФормирования = "Оба" Тогда
		НаименованиеПолное = НоменклатураСервер.НаименованиеПоШаблону(ШаблонНаименованияДляПечати, СправочникОбъект);
		СтруктураНаименований.НаименованиеПолное = НаименованиеПолное;
	КонецЕсли;
	
	Возврат СтруктураНаименований;
	
КонецФункции

// Формирует наименование элемента справочника по заданному для вида номенклатуры шаблону.
//
//Параметры:
//		ДанныеДляФормированияНаименования - Структура - структура, возвращаемая фукнцией НоменклатураСервер.ФормулаНаименования
//		ВидНоменклатуры - СправочникСслыка.ВидыНоменклатуры	- вид номенклатуры, в котором задан шаблон наименования
//		Наименование - Строка - в формулу полного наименования может входить наименование. Наименование может быть не
//								заполнено на момент формирования массива ДанныеДляФормированияНаименования.МассивЗначенийРеквизитов,
//								поэтому перед расчетом полного наименования значение наименования нужно обновить
// Возвращаемое значение:
// Строка - Наименование полученное по алгоритму расчета
// Пустая строка - если не удалось сформировать наименование или не заполнены операнды алгоритма
//
Функция НаименованиеПоФормуле(ДанныеДляФормированияНаименования, ВидНоменклатуры, ЗначениеНаименования = "") Экспорт
	
	Наименование = "";
	Если ЗначениеЗаполнено(ДанныеДляФормированияНаименования.ФормулаНаименования) Тогда
		
		МассивЗначенийРеквизитов = ДанныеДляФормированияНаименования.МассивЗначенийРеквизитов;
		
		Для Каждого Индекс из ДанныеДляФормированияНаименования.ИндексыНаименованияВМассивеЗначенийРеквизитов Цикл
			МассивЗначенийРеквизитов[Индекс] = ЗначениеНаименования;
		КонецЦикла;
		
		Попытка
			
			Выполнить("Наименование = """" + " + ДанныеДляФормированияНаименования.ФормулаНаименования);
			
		Исключение
			
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции

// Примитивная проверка на наличие характеристики с аналогичными Свойствами "ТаблицаСвойствЗначений"
//
Функция ПроверитьУникальностьХарактеристик(Владелец, ТаблицаСвойствЗначений) Экспорт
	
	КоличествоСвойств = 0;
	Для каждого стрСвойство Из ТаблицаСвойствЗначений Цикл
		Если ЗначениеЗаполнено(стрСвойство.Значение) Тогда
			КоличествоСвойств = КоличествоСвойств + 1;	
		КонецЕсли; 	
	КонецЦикла;                            
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка,
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство,
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение,
	|	1 КАК Счетчик
	|ПОМЕСТИТЬ втХарактеристики
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|ГДЕ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСвойств.Свойство,
	|	ТабСвойств.Значение
	|ПОМЕСТИТЬ втСвойства
	|ИЗ
	|	&ТабСвойств КАК ТабСвойств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втХарактеристики.Ссылка КАК Ссылка,
	|	СУММА(ЕСТЬNULL(втХарактеристики.Счетчик, 0)) КАК Счетчик
	|ПОМЕСТИТЬ втОтобранныеХарактеристики
	|ИЗ
	|	втСвойства КАК втСвойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ втХарактеристики КАК втХарактеристики
	|		ПО (втХарактеристики.Свойство = втСвойства.Свойство)
	|			И (втХарактеристики.Значение = втСвойства.Значение)
	|
	|СГРУППИРОВАТЬ ПО
	|	втХарактеристики.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОтобранныеХарактеристики.Ссылка
	|ИЗ
	|	втОтобранныеХарактеристики КАК втОтобранныеХарактеристики";
	//|ГДЕ
	//|	втОтобранныеХарактеристики.Счетчик = &КоличествоСвойств";
	//
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ТабСвойств", ТаблицаСвойствЗначений);
	Запрос.УстановитьПараметр("КоличествоСвойств", КоличествоСвойств);
	
	РезультатЗапросаХарактеристики = Запрос.Выполнить();  // РезультатЗапросаХарактеристики.Выгрузить()
	
	Если Не РезультатЗапросаХарактеристики.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
КонецФункции //ПроверитьУникальностьХарактеристик()

// Проверяет наличие характеристики с аналогичными параметрами по регистру сведений
// "ПараметрыХарактеристик"
// СсылкаНаХарактеристику - нужна только при записи справочника характеристика, чтобы можно было перезаписать существующую характеристику
Функция ПроверитьХарактеристикуПоПараметрам(Владелец, ТаблицаСвойствЗначений, СсылкаНаХарактеристику=Неопределено) Экспорт
	Если СсылкаНаХарактеристику = Неопределено тогда
		СсылкаНаХарактеристику = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Сч = 0;
	Для каждого стрРеквизит Из ТаблицаСвойствЗначений Цикл
		Если ЗначениеЗаполнено(стрРеквизит) Тогда
			Сч = Сч + 1;	
		КонецЕсли; 
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода) Тогда
			Порода = стрРеквизит.Значение;	
		КонецЕсли; 
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сорт) Тогда
			Сорт = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Длина) Тогда
			Длина = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сечение) Тогда
			Сечение = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Влажность) Тогда
			Влажность = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Поверхность) Тогда
			Поверхность = стрРеквизит.Значение;	
		КонецЕсли;
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыХарактеристик.Характеристика
	|ИЗ
	|	РегистрСведений.алк_ПараметрыХарактеристик КАК ПараметрыХарактеристик
	|ГДЕ
	|	ПараметрыХарактеристик.Порода = &Порода
	|	И ПараметрыХарактеристик.Сорт = &Сорт
	|	И ПараметрыХарактеристик.Длина = &Длина
	|	И ПараметрыХарактеристик.Сечение = &Сечение
	|	И ПараметрыХарактеристик.Влажность = &Влажность
	|	И ПараметрыХарактеристик.Характеристика.Владелец = &Владелец
	|	И ПараметрыХарактеристик.КоличествоРеквизитов = &КоличествоРеквизитов
	|	И ПараметрыХарактеристик.Характеристика <> &СсылкаНаХарактеристику
	|	И ПараметрыХарактеристик.Поверхность = &Поверхность";
	
	Запрос.УстановитьПараметр("Порода",    ?(Порода <> Неопределено, Порода, Справочники.Породы.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Сорт",      ?(Сорт <> Неопределено, Сорт, Справочники.Сорта.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Длина",     ?(Длина <> Неопределено, Длина, Справочники.Длины.ПустаяСсылка()));	
	Запрос.УстановитьПараметр("Сечение",   ?(Сечение <> Неопределено, Сечение, Справочники.РазмерСечения.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Влажность", ?(Влажность <> Неопределено, Влажность, Справочники.Влажность.ПустаяСсылка()));  
	Запрос.УстановитьПараметр("Поверхность", ?(Поверхность <> Неопределено, Поверхность, Справочники.Поверхности.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Владелец",  Владелец);
	Запрос.УстановитьПараметр("КоличествоРеквизитов",  Сч);
	Запрос.УстановитьПараметр("СсылкаНаХарактеристику", СсылкаНаХарактеристику);

	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
КонецФункции //ПроверитьХарактеристикуПоПараметрам()

// Получает характеристику с аналогичными параметрами по данным регистра сведений
// "ПараметрыХарактеристик"
//
Функция ПолучитьХарактеристикуПоПараметрам(Владелец, ТаблицаСвойствЗначений) Экспорт
	
	Если ТипЗнч(ТаблицаСвойствЗначений) = Тип("ТаблицаЗначений") Тогда
		
	Иначе
		
		ТаблицаСвойствЗначений = ТаблицаСвойствЗначений.Выгрузить();
		
	КонецЕсли; 
	
	Сч = 0;
	Для каждого стрРеквизит Из ТаблицаСвойствЗначений Цикл
		Если ЗначениеЗаполнено(стрРеквизит) Тогда
			Сч = Сч + 1;	
		КонецЕсли; 
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода) Тогда
			Порода = стрРеквизит.Значение;	
		КонецЕсли; 
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сорт) Тогда
			Сорт = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Длина) Тогда
			Длина = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сечение) Тогда
			Сечение = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Влажность) Тогда
			Влажность = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Поверхность) Тогда
			Поверхность = стрРеквизит.Значение;	
		КонецЕсли;
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыХарактеристик.Характеристика
	|ИЗ
	|	РегистрСведений.алк_ПараметрыХарактеристик КАК ПараметрыХарактеристик
	|ГДЕ
	|	ПараметрыХарактеристик.Порода = &Порода
	|	И ПараметрыХарактеристик.Сорт = &Сорт
	|	И ПараметрыХарактеристик.Длина = &Длина
	|	И ПараметрыХарактеристик.Сечение = &Сечение
	|	И ПараметрыХарактеристик.Влажность = &Влажность
	|	И ПараметрыХарактеристик.Характеристика.Владелец = &Владелец
	|	И ПараметрыХарактеристик.КоличествоРеквизитов = &КоличествоРеквизитов
	|	И ПараметрыХарактеристик.Поверхность = &Поверхность";
	
	Запрос.УстановитьПараметр("Порода",    ?(Порода <> Неопределено, Порода, Справочники.Породы.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Сорт",      ?(Сорт <> Неопределено, Сорт, Справочники.Сорта.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Длина",     ?(Длина <> Неопределено, Длина, Справочники.Длины.ПустаяСсылка()));	
	Запрос.УстановитьПараметр("Сечение",   ?(Сечение <> Неопределено, Сечение, Справочники.РазмерСечения.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Влажность", ?(Влажность <> Неопределено, Влажность, Справочники.Влажность.ПустаяСсылка()));  
	Запрос.УстановитьПараметр("Поверхность", ?(Поверхность <> Неопределено, Поверхность, Справочники.Поверхности.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Владелец",  Владелец);
	Запрос.УстановитьПараметр("КоличествоРеквизитов",  Сч);

	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать(); Выборка.Следующий();
		Возврат Выборка.Характеристика;
	Иначе
		Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции //ПолучитьХарактеристикуПоПараметрам()

Процедура ЗапретРедактированияПередЗаписью(Источник, Отказ) Экспорт
	
	Если Не РольДоступна("Администратор_РФП") Тогда
		Отказ = АлгоритмыСвойстваИХарактеристики.ПроверитьХарактеристикуПоПараметрам(Источник.Владелец, Источник.ДополнительныеРеквизиты.Выгрузить());		
	КонецЕсли; 	
	
КонецПроцедуры


#Область ФиксированныеДополнительныеРеквизиты

Функция ПараметрыХарактеристики(Характеристика) Экспорт
	
	СтруктураПараметров = Новый Структура("Порода, Сорт, Длина, Сечение, Влажность, Поверхность", 
	Справочники.Породы.ПустаяСсылка(),
	Справочники.Сорта.ПустаяСсылка(),
	Справочники.Длины.ПустаяСсылка(),
	Справочники.РазмерСечения.ПустаяСсылка(),
	Справочники.Влажность.ПустаяСсылка(),
	Справочники.Поверхности.ПустаяСсылка());
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПараметрыХарактеристик.Порода,
		|	ПараметрыХарактеристик.Сорт,
		|	ПараметрыХарактеристик.Длина,
		|	ПараметрыХарактеристик.Сечение,
		|	ПараметрыХарактеристик.Влажность,
		|	ПараметрыХарактеристик.Поверхность
		|ИЗ
		|	РегистрСведений.алк_ПараметрыХарактеристик КАК ПараметрыХарактеристик
		|ГДЕ
		|	ПараметрыХарактеристик.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ВыборкаДетальныеЗаписи);	
	КонецЕсли; 	
	
	Возврат СтруктураПараметров;
КонецФункции

	
#КонецОбласти 


// ************************** Подписки **************************

// Процедура записвыет дополнительные реквизиты характеристики в регистр сведений
// "ПараметрыХарактеристик"
//
Процедура ЗаполнитьПараметрыХарактеристикиПриЗаписи(Источник, Отказ) Экспорт
	
	НаборЗаписей = РегистрыСведений.алк_ПараметрыХарактеристик.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Характеристика.Установить(Источник.Ссылка);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Характеристика = Источник.Ссылка;
	Для каждого стрРеквизит Из Источник.ДополнительныеРеквизиты Цикл
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода) Тогда
			НоваяЗапись.Порода = стрРеквизит.Значение;	
		КонецЕсли; 
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сорт) Тогда
			НоваяЗапись.Сорт = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Длина) Тогда
			НоваяЗапись.Длина = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сечение) Тогда
			НоваяЗапись.Сечение = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Влажность) Тогда
			НоваяЗапись.Влажность = стрРеквизит.Значение;	
		КонецЕсли; 
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Поверхность) Тогда
			НоваяЗапись.Поверхность = стрРеквизит.Значение;	
		КонецЕсли;
	КонецЦикла; 
	НаборЗаписей.Записать();

КонецПроцедуры

// Процедура записвыет дополнительные реквизиты характеристики в регистр сведений
// "алк_ПарметрыСерийныхНомеров"
//
Процедура ЗаполнитьПараметрыСерийногоНомераПриЗаписи(Источник, Отказ) Экспорт
	
	Если Не НоменклатураСервер.НаименованиеСоответствуетГодовомуШаблону(Источник) Тогда
		Отказ = Истина;
		Возврат;	
	КонецЕсли; 
	
	НаборЗаписей = РегистрыСведений.алк_ПараметрыСерийныхНомеров.СоздатьНаборЗаписей();
	
	НомерСерии  = НоменклатураСервер.НомерСерии(Источник.Ссылка);
	ПериодСерии = НоменклатураСервер.ПериодСерии(Источник.Ссылка);
	
	НаборЗаписей.Отбор.СерийныйНомер.Установить(Источник.Ссылка);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Номенклатура = Источник.Владелец;
	НоваяЗапись.НомерСерии   = НомерСерии;
	НоваяЗапись.ПериодСерии  = ПериодСерии;
	
	НоваяЗапись.СерийныйНомер = Источник.Ссылка;
	
	НаборЗаписей.Записать();

КонецПроцедуры
